{
  "cases": [
    {
      "id": "001",
      "problem_description": "To prevent water erosion of river banks, they can be strengthened with stones. However, water gradually washes sand and soil from under the stones, and the shoreline collapses. What can we do?",
      "plus_factor_index": [32],
      "minus_factor_index": [30],
      "principle_index": [2, 24],
      "solutions": [
        {
          "content": "The stones are fixed with durable mesh wire. Moreover, the stones can be placed inside prefabricated sections similar to mesh wire baskets – thereby giving the construction the required shape and size.",
          "principle_index": [24]
        }
      ],
      "notes": "Michael A. Orloff, Modern TRIZ, Page 187."
    },
    {
      "id": "002",
      "problem_description": "Any two-wheel scooter or bicycle remains stable only when in motion. In other words, these devices are \"dynamically stable\". However, when they stop, they fall down on their side. There are known systems that can stabilize spatial position using liquid equilibrium detectors and gyroscopic stabilizers. However, there is \"nothing to stabilize\" in a bicycle transversely – the only thing we can do is install a sophisticated \"scales-like\" system so as to make it possible, by constantly balancing, to keep the mass center of the system strictly within the support area. But that seems too complex and completely unjustified. Can we build a two-wheel vehicle which would be able to rapidly move along, carrying its \"pilot\" or \"passenger\" (whatever turns you on!), and keep upright without falling when forced to stop?",
      "plus_factor_index": [27],
      "minus_factor_index": [36],
      "principle_index": [1,13,35],
      "solutions": [
        {
          "content": "If we have no resource that we can use to adjust the position of the scooter transversely, we can do it longitudinally, while transverse stability can be assured if the wheels are placed not one after the other (as is usually the case), but coaxially so that they are attached to the edges of the scooter! Now we have spatial and functional resources that we can use for steering!",
          "principle_index": [13]
        }
      ],
      "notes": "Michael A. Orloff, Modern TRIZ, Page 368."
    },
    {
      "id": "003",
      "problem_description": "Different special training devices were set up at a fitness club. Every device takes up space, especially those designed for training in a lying position. Devices for training while standing take up less space. Space should be saved so that more guests can work out on the stations. Can you design a training station or machine to solve this problem?",
      "plus_factor_index": [39],
      "minus_factor_index": [6],
      "principle_index": [10,35,17,7],
      "solutions": [
        {
          "content": "Design a machine that allows guests to do different exercises from all four sides. The moveable weights are mounted on all four sides of the station and cables with rollers are threaded through consoles that are installed at different levels according to the type of exercise done.",
          "principle_index": [7,17]
        }
      ],
      "notes": "Michael A. Orloff, Inventive Thinking through TRIZ, Page 109."
    },
    {
      "id": "004",
      "problem_description": "Extinguishing fires at oil and gas drilling sites is a major environmental disaster, made difficult by the extreme heat and limited options for action, often requiring the use of tanks and bombs to cover the well with dirt. Approaching the well with other methods is impossible due to the scorching temperatures in the surrounding area, causing fires to last for months, burning large amounts of material and causing significant environmental harm by contaminating nearby ground and water with oil products.",
      "plus_factor_index": [33],
      "minus_factor_index": [30],
      "principle_index": [2,25,28,39],
      "solutions": [
        {
          "content": "To address this problem, an additional auxiliary well is drilled at an angle to intersect with the shaft of the burning well at a safe depth. Explosives and other solutions can then be introduced into the burning well through this auxiliary shaft to seal it with a kind of \"plug\" at a secure depth.As part of our control solution, a method developed in Russia involves the use of a special \"underground vehicle\" that approaches the burning well's shaft at an angle from a safe distance. The vehicle can function like an underground bulldozer at the point where it meets the well's shaft, gradually sealing it completely with stone or earth.",
          "principle_index": [2]
        }
      ],
      "notes": "Michael A. Orloff, Inventive Thinking through TRIZ, Page 143."
    },
    {
      "id": "005",
      "problem_description": "If the blade is made heavier, it can strike a more effective blow with better splitting power, but the quantity of material used increases making the device more awkward to handle.",
      "plus_factor_index": [10],
      "minus_factor_index": [26],
      "principle_index": [14,29,18,36],
      "solutions": [
        {
          "content": "The axe developed for Fiskars makes use of a hollow handle to resolve the issue using the pneumatics and hydraulics principle. By using a hollow handle (i.e. replacing solid parts of an object with) in this case, air, the centre of gravity is moved forward and the effective blow from the axe becomes more powerful from a lighter tool.",
          "principle_index": [29]
        }
      ],
      "notes": "Peter R.N. Childs, Mechanical Design Engineering Handbook (Second Edition), Page 131."
    },
    {
      "id": "006",
      "problem_description": "In competitive high diving, it is important for the diver to engage in much practice but repetitive diving involves multiple impacts between the diver and the water potentially leading to injuries.",
      "plus_factor_index": [9],
      "minus_factor_index": [27],
      "principle_index": [11,35,37,28],
      "solutions": [
        {
          "content": "Using aeration of water to make it softer during diving practice enabling more dives to be undertaken.",
          "principle_index": [11]
        }
      ],
      "notes": "Peter R.N. Childs, Mechanical Design Engineering Handbook (Second Edition), Page 136."
    },
    {
      "id": "007",
      "problem_description": "We are faced with a challenge involving the pneumatic transportation of metal shots through a system of plastic piping originally intended for plastic pellets. The transition to metal shots, despite their advantages for production purposes, has led to significant wear and damage, particularly at the pipe's elbows. This issue arises from the incompatibility between the metal shots and the existing plastic elbow design. The task at hand is to identify and implement a solution that resolves this conflict, ensuring the system's durability and effectiveness for transporting metal shots.",
      "plus_factor_index": [9],
      "minus_factor_index": [13],
      "principle_index": [28,33,1,18],
      "solutions": [
        {
          "content": "Placing a magnet at the elbow to bind metal shots to a plastic material, providing a blanket of shots that then absorb the energy.",
          "principle_index": [28]
        }
      ],
      "notes": "Semyon D. Savransky, Engineering of creativity introduction to TRIZ methodology of inventive problem solving, Page 229."
    },
    {
      "id": "008",
      "problem_description": "Can wall needs to be cheap enough to mass produce; at the same time the layering of can materials is complex.",
      "plus_factor_index": [32],
      "minus_factor_index": [36],
      "principle_index": [1,26,27],
      "solutions": [
        {
          "content": "Changing blow-molding process to be less precise and added a trimming step to the blow-molding step.",
          "principle_index": [1]
        }
      ],
      "notes": "David Silverstein, Insourcing Innovation How to Achieve Competitive Excellence Using TRIZ, Page 82."
    },
    {
      "id": "009",
      "problem_description": "Thermal stresses in the skin structure of aircraft are not wanted. To offset thermal deformations, small spaces are intentionally left between the panels of the aircraft's skin. To make the surface aerodynamically sleek, gaps are filled with a sealant made from polymer (in paste form). The process of applying this paste to fill the gaps requires a lot of labor and takes a lot of time.",
      "plus_factor_index": [33],
      "minus_factor_index": [22],
      "principle_index": [2,19,13],
      "solutions": [
        {
          "content": "It would be sufficient if the sealant just covered the gap between the panels. This would ease the process of closing the gaps, and would not degrade the aerodynamic properties of the aircraft skin. Specifically, A metal cap with an elastomeric retainer snaps into the gap, thus making its installation very quick.",
          "principle_index": [2]
        }
      ],
      "notes": "Victor Fey, Innovation on Demand New Product Development Using TRIZ, Page 193."
    },
    {
      "id": "010",
      "problem_description": "It is necessary to move cargo in the winter through waterways that can be covered by as much as 10 feet of ice. Traditionally, icebreakers have been used to open a channel through the ice for a convoy of ships to follow. The icebreaker can only advance at a speed of 2 km/hr. We need to increase this rate to at least 6 km/hr, although faster would be even more desirable. Alternative means of transportation are not acceptable. Our investigation shows that the icebreaker has the most efficient engine available in industry at this time.",
      "plus_factor_index": [9],
      "minus_factor_index": [21],
      "principle_index": [19,35,28,2],
      "solutions": [
        {
          "content": "Utilizing either of these principles can provide an ice breaking action. For example, instead of continuously pushing the ship through the ice, a rocking motion can be used to break the ice and then move forward.",
          "principle_index": [19]
        },
        {
          "content": "We can change the part of the ship which contacts the ice. Removing the part completely allows the ship to move through the ice with no problem — except that the bottom part of the ship will sink to the ocean floor. To prevent this, both the upper and lower parts of the ship can be connected by two thin vertical blades that cut the ice much more easily. Minimizing the profile of the ship reduces its drag as it cuts through the ice. The bottom part of the ship will stay below the ice while carrying cargo. Now the icebreaker also doubles as a cargo ship.",
          "principle_index": [2,35]
        }
      ],
      "notes": "Genrich Altshuller, Innovation Algorithm, Page 279"
    }
  ]
}
